app/controllers/discussions_controller.rb

SELECT "discussions".* FROM "discussions"
---
  def index
    @discussions = Discussion.all

SELECT  "discussions".* FROM "discussions" WHERE "discussions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @discussion = Discussion.find(params[:id])

INSERT INTO "discussions" ("headline", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["headline", "Reef Aquascaping"], ["content", "Minimalist design is the best!"], ["created_at", "2018-08-20 03:28:58.660086"], ["updated_at", "2018-08-20 03:28:58.660086"], ["user_id", 1]]
---
  def create
    @discussion = current_user.discussions.new(discussion_params)

    respond_to do |format|
      if @discussion.save

DELETE FROM "discussions" WHERE "discussions"."id" = $1  [["id", 4]]
---
  def destroy
    @discussion.destroy

SELECT  "discussions".* FROM "discussions" WHERE "discussions"."user_id" = $1 AND "discussions"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 7], ["LIMIT", 1]]
---
  def set_own_discussion
    begin
      @discussion = current_user.discussions.find(params[:id])