app/controllers/photos_controller.rb

INSERT INTO "photos" ("name", "created_at", "updated_at", "image_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", ""], ["created_at", "2018-08-21 04:16:05.751280"], ["updated_at", "2018-08-21 04:16:05.751280"], ["image_id", "4af1a3cd1617d28b7ba5e8431b8038659e00b1f543dc584b221d81dd53cc"]]
---
  def create
    @photo = Photo.new(photo_params)

    respond_to do |format|
      if @photo.save

UPDATE "photos" SET "image_id" = $1, "updated_at" = $2 WHERE "photos"."id" = $3  [["image_id", "386dddbb70c64cff50d9e9a3ca8402689fb1e318e751248f6f23a22c432b"], ["updated_at", "2018-08-21 14:02:28.855177"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @photo.update(photo_params)