app/controllers/sessions_controller.rb

INSERT INTO "users" ("provider", "uid", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["provider", "twitter"], ["uid", "805526055377321984"], ["created_at", "2018-08-19 22:14:30.692698"], ["updated_at", "2018-08-19 22:14:30.692698"]]
---
  def new
    user = User.create_or_update_from(request.env["omniauth.auth"])