app/models/user.rb

  def self.create_or_update_from(auth_info)
    user = where(uid: auth_info[:uid], provider: auth_info[:provider]).first_or_create
    user.update(
      nickname: auth_info[:info][:nickname],
      name: auth_info[:info][:name],
      email: auth_info[:info][:email],
      location: auth_info[:info][:location],
      image_url: auth_info[:info][:image],
      description: auth_info[:info][:description],
      token: auth_info[:credentials][:token],
      secret: auth_info[:credentials][:secret],
    )
---
INSERT INTO "users" ("provider", "uid", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["provider", "twitter"], ["uid", "805526055377321984"], ["created_at", "2018-08-19 22:14:30.692698"], ["updated_at", "2018-08-19 22:14:30.692698"]]
SELECT  "users".* FROM "users" WHERE "users"."uid" = $1 AND "users"."provider" = $2 ORDER BY "users"."id" ASC LIMIT $3  [["uid", "805526055377321984"], ["provider", "twitter"], ["LIMIT", 1]]
UPDATE "users" SET "image_url" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["image_url", "http://pbs.twimg.com/profile_images/1031369307853217792/k78E0shw_normal.jpg"], ["updated_at", "2018-08-20 02:36:47.711737"], ["id", 1]]